Revit 2027 API
TextNoteOptions.VerticalAlignment Property
 Vertical alignment of the text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public VerticalTextAlignment VerticalAlignment { get; set; }
Public Property VerticalAlignment As VerticalTextAlignment
	Get
	Set
public:
property VerticalTextAlignment VerticalAlignment {
	VerticalTextAlignment get ();
	void set (VerticalTextAlignment value);
}
member VerticalAlignment : VerticalTextAlignment with get, set
Property Value
VerticalTextAlignment
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 Default is Top alignment.
See Also
Reference
TextNoteOptions Class
Autodesk.Revit.DB Namespace